In [19]:
#create a data frame with missing frames
import pandas as pd
import numpy as np

In [20]:
df=pd.DataFrame([[10, np.nan], [20,39],[80,39],[np.nan,49]])
df.columns = ['A','B']
df

      A     B
0  10.0   NaN
1  20.0  39.0
2  80.0  39.0
3   NaN  49.0

In [21]:
df.drop_duplicates('B')

      A     B
0  10.0   NaN
1  20.0  39.0
3   NaN  49.0

In [22]:
#find missing values
df.isna()

       A      B
0  False   True
1  False  False
2  False  False
3   True  False

In [23]:
df.isna().sum()

A    1
B    1
dtype: int64

In [24]:
#dropping missing values
#handling missing values
#create a DataFrame with Missing values
df=pd.DataFrame([[10, np.nan], [20,39],[80,39],[np.nan,49]])
df.columns = ['A','B']

In [25]:
#drop null values
df.dropna()

      A     B
1  20.0  39.0
2  80.0  39.0

In [26]:
#Filling Missing Values
df=pd.DataFrame([[10, np.nan], [20,39],[80,39],[np.nan,49]])
df.columns = ['A','B']
df

      A     B
0  10.0   NaN
1  20.0  39.0
2  80.0  39.0
3   NaN  49.0

In [27]:
df.fillna(value = {'A':100,'B':200})

       A      B
0   10.0  200.0
1   20.0   39.0
2   80.0   39.0
3  100.0   49.0